const os = require('os');
const { tlang, botpic,cmd, prefix, runtime,Config,formatp } = require('../lib')
const axios = require('axios')
const speed = require('performance-now')

//---------------------------------------------------------------------------

cmd({

            pattern: "1",

            desc: "(menu cmdlist).",

            category: "list",

            react: "🧞‍♀️",

            filename: __filename,

            use: '<faded-Alan walker.>',

        },

        async(Void, citel, text) => {

         

            let buttons = [{

                    buttonId: `${prefix}system`,

                    buttonText: {

                        displayText: "System",

                    },

                    type: 1,

                },

                  {

                    buttonId: `${prefix}ping`,

                    buttonText: {

                        displayText: "Ping",

                    },

                    type: 1,

                },

            ];

            let buttonMessage = {

                image: {

                    url: 'https://telegra.ph/file/b161b6cf6c9597b67c23d.jpg',

                },

                caption: `
┏━━━━━━━━━━━━━━━✦
┃ ┌╼╼╼╼╼╼╼╼╼╼●
┃ │ *𝙳𝙾𝚆𝙽𝙻𝙾𝙳𝙴𝚁 𝙲𝙾𝙼𝙼𝙰𝙽𝙳𝚂*
┃ ├╼╼╼╼╼╼╼╼╼╼●
┃ ├❑🧜‍♂️⃟➤ᴅᴏᴡɴᴀᴘᴋ
┃ ├❑🧜‍♂️⃟➤ɪᴏꜱ
┃ ├❑🧜‍♂️⃟➤ɪᴏꜱᴛ
┃ ├❑🧜‍♂️⃟➤ɴᴀꜱᴀ
┃ ├❑🧜‍♂️⃟➤ᴡᴀʙᴇᴛᴀ
┃ ├❑🧜‍♂️⃟➤ᴛᴛꜱ
┃ ├❑🧜‍♂️⃟➤ʏᴛꜱ
┃ ├❑🧜‍♂️⃟➤ᴠɪᴅᴇᴏ
┃ ├❑🧜‍♂️⃟➤ᴘʟᴀʏ
┃ ├❑🧜‍♂️⃟➤ʀɪɴɢᴛᴏɴᴇ
┃ ├❑🧜‍♂️⃟➤ᴘɪɴᴛ
┃ ├❑🧜‍♂️⃟➤ᴍᴇᴅɪᴀꜰɪʀᴇ
┃ ├❑🧜‍♂️⃟➤ʏᴛᴍᴘ4
┃ ├❑🧜‍♂️⃟➤ʏᴛᴍᴘ3
┃ ├❑🧜‍♂️⃟➤ʏᴛᴅᴏᴄ
┃ ├❑🧜‍♂️⃟➤ꜱꜱ
┃ ├❑🧜‍♂️⃟➤ꜰʙ
┃ ├❑🧜‍♂️⃟➤ᴛɪᴋᴛᴏᴋ
┃ ├❑🧜‍♂️⃟➤ᴛᴠɪᴅᴇᴏ
┃ ├❑🧜‍♂️⃟➤ꜰʙꜱ
┃ ├❑🧜‍♂️⃟➤ᴅᴀᴅᴜ
┃ ├❑🧜‍♂️⃟➤ᴛᴛᴘ
┃ ├❑🧜‍♂️⃟➤ᴠɪᴅᴇᴏ3
┃ ├❑🧜‍♂️⃟➤ᴛᴇꜱᴛꜱᴏɴɢ
┃ ├❑🧜‍♂️⃟➤ᴀᴛᴛᴘ
┃ ├❑🧜‍♂️⃟➤ᴛɪᴋᴛᴏᴋ
┃ ├❑🧜‍♂️⃟➤ᴘʟᴀʏʟɪꜱᴛ
┃ └╼╼╼╼╼╼╼╼╼╼●
┗╾╾╾╾╾╾╾╾╾╾╾╾╾╾╾✦
🎩 *_ᴅᴀʀᴋ Qᴜᴇᴇɴ ᴍᴅ_*🎩
🎭 *_ᴄʀᴇᴀᴛᴇᴅ ʙʏ ᴅᴀʀᴋ Qᴜᴇᴇɴ ᴛᴇᴀᴍ_*🎭
`,

                footer: tlang().footer,


                headerType: 4,

            };

            return Void.sendMessage(citel.chat, buttonMessage, {

                quoted: citel,

            });

        }

    )

    //---------------------------------------------------------------------------

cmd({

            pattern: "3",
            alias: [""],

            desc: "(menu cmdlist).",

            category: "list",

            react: "🌐",

            filename: __filename,

            use: '<faded-Alan walker.>',

        },

        async(Void, citel, text) => {


            let buttonMessage = {

                image: {

                    url: 'https://telegra.ph/file/0c720772bcbd9576c0e7f.jpg',

                },

                caption: `
┏━━━━━━━━━━━━━━━✦
┃ ┌╼╼╼╼╼╼╼╼╼╼●
┃ │ *𝙶𝚁𝙾𝚄𝙿 𝙲𝙾𝙼𝙼𝙰𝙽𝙳𝚂*
┃ ├╼╼╼╼╼╼╼╼╼╼●
┃ ├❑🧞‍♀️⃟➤ꜱᴛɪᴄᴋᴇʀ
┃ ├❑🧞‍♀️⃟➤ꜱᴜᴘᴘᴏʀᴛ
┃ ├❑🧞‍♀️⃟➤ᴡᴀʀɴ
┃ ├❑🧞‍♀️⃟➤ᴛᴀɢᴀʟʟ
┃ ├❑🧞‍♀️⃟➤ʀᴇϙᴜᴇꜱᴛ
┃ ├❑🧞‍♀️⃟➤ʀᴇᴛʀɪᴠᴇ
┃ ├❑🧞‍♀️⃟➤ʀᴇꜱᴇᴛᴡᴀʀɴ
┃ ├❑🧞‍♀️⃟➤ᴘᴏʟʟ
┃ ├❑🧞‍♀️⃟➤ᴘʀᴏꜰɪʟᴇ
┃ ├❑🧞‍♀️⃟➤ʀᴀɴᴋ
┃ ├❑🧞‍♀️⃟➤ᴘʀᴏᴍᴏᴛᴇ
┃ ├❑🧞‍♀️⃟➤ᴋɪᴄᴋ
┃ ├❑🧞‍♀️⃟➤ᴍᴇᴍᴇɢᴇɴ
┃ ├❑🧞‍♀️⃟➤ɢʀᴏᴜᴘ
┃ ├❑🧞‍♀️⃟➤ɢʀᴏᴜᴘᴘɪᴄ
┃ ├❑🧞‍♀️⃟➤ʜɪᴅᴇᴛᴀɢ
┃ ├❑🧞‍♀️⃟➤ᴀᴅᴅ
┃ ├❑🧞‍♀️⃟➤ɢᴇᴛᴊɪᴅꜱ
┃ ├❑🧞‍♀️⃟➤ᴅᴇᴍᴏᴛᴇ
┃ ├❑🧞‍♀️⃟➤ᴅᴇʟ
┃ ├❑🧞‍♀️⃟➤ᴄʜᴇᴄᴋᴡᴀʀɴ
┃ ├❑🧞‍♀️⃟➤ʙʀᴏᴀᴅᴄᴀꜱᴛ
┃ ├❑🧞‍♀️⃟➤ᴀɴᴛɪʟɪɴᴋ
┃ ├❑🧞‍♀️⃟➤ᴀᴄᴛ
┃ ├❑🧞‍♀️⃟➤ᴅᴇᴀᴄᴛ
┃ └╼╼╼╼╼╼╼╼╼╼●
┗━━━━━━━━━━━━━━━✦
🎩 *_ᴅᴀʀᴋ Qᴜᴇᴇɴ ᴍᴅ_*🎩
🎭 *_ᴄʀᴇᴀᴛᴇᴅ ʙʏ ᴅᴀʀᴋ Qᴜᴇᴇɴ ᴛᴇᴀᴍ_*🎭
`,

                footer: tlang().footer,


                headerType: 4,

            };

            return Void.sendMessage(citel.chat, buttonMessage, {

                quoted: citel,

            });

        }

    )

//---------------------------------------------------------------------------

cmd({

            pattern: "4",

            desc: "(menu cmdlist).",

            category: "list",

            react: "⚙️",

            filename: __filename,

            use: '<faded-Alan walker.>',

        },

        async(Void, citel, text) => {

         

            let buttonMessage = {

                image: {

                    url: 'https://telegra.ph/file/4b91a3be12a730ab19662.jpg',

                },

                caption: `

┏━━━━━━━━━━━━━━━✦
┃ ┌╼╼╼╼╼╼╼╼╼╼●
┃ │ *𝚃𝙴𝚇𝚃𝙿𝚁𝙾 𝙲𝙾𝙼𝙼𝙰𝙽𝙳𝚂*
┃ ├╼╼╼╼╼╼╼╼╼╼●
┃ ├❑🌿⃟➤ᴅᴇᴇᴘꜱᴇᴀ
┃ ├❑🌿⃟➤ʜᴏʀʀᴏʀ
┃ ├❑🌿⃟➤ᴡʜɪᴛᴇʙᴇᴀʀ
┃ ├❑🌿⃟➤ᴊᴏᴋᴇʀ
┃ ├❑🌿⃟➤ᴍᴇᴛᴀʟʟɪᴄ
┃ ├❑🌿⃟➤ꜱᴛᴇᴇʟ
┃ ├❑🌿⃟➤ʜᴀʀʀʏᴘᴏᴛᴛᴇʀ
┃ ├❑🌿⃟➤ᴜɴᴅᴇʀᴡᴀᴛᴇʀ
┃ ├❑🌿⃟➤ʟᴜxᴜʀʏ
┃ ├❑🌿⃟➤ɢʟᴜᴇ
┃ ├❑🌿⃟➤ꜰᴀʙʀɪᴄ
┃ ├❑🌿⃟➤ᴛᴏxɪᴄ
┃ ├❑🌿⃟➤ᴀɴᴄɪᴇɴᴛ
┃ ├❑🌿⃟➤ᴄʟᴏᴜᴅ
┃ ├❑🌿⃟➤ᴛʀᴀɴꜱꜰᴏʀᴍᴇʀ
┃ ├❑🌿⃟➤ᴛʜᴜɴᴅᴇʀ
┃ ├❑🌿⃟➤ꜱᴄɪꜰɪ
┃ ├❑🌿⃟➤ꜱᴀɴᴅ
┃ ├❑🌿⃟➤ʀᴀɪɴʙᴏᴡ
┃ ├❑🌿⃟➤ᴘᴇɴᴄɪʟ
┃ ├❑🌿⃟➤ɴᴇᴏɴ
┃ ├❑🌿⃟➤ᴍᴀɢᴍᴀ
┃ ├❑🌿⃟➤ʟᴇᴀᴠᴇꜱ
┃ ├❑🌿⃟➤ɢʟɪᴛᴄʜ
┃ ├❑🌿⃟➤ᴅɪꜱᴄᴏᴠᴇʀʏ
┃ ├❑🌿⃟➤ᴄʜʀɪꜱᴛᴍᴀꜱ
┃ ├❑🌿⃟➤ᴄᴀɴᴅʏ
┃ ├❑🌿⃟➤1917
┃ ├❑🌿⃟➤ɴᴇᴡᴛᴇxᴛ
┃ ├❑🌿⃟➤ʙʟᴀᴄᴋᴘɪɴᴋ
┃ └╼╼╼╼╼╼╼╼╼╼●
┗━━━━━━━━━━━━━━━✦
🎩 *_ᴅᴀʀᴋ Qᴜᴇᴇɴ ᴍᴅ_*🎩
🎭 *_ᴄʀᴇᴀᴛᴇᴅ ʙʏ ᴅᴀʀᴋ Qᴜᴇᴇɴ ᴛᴇᴀᴍ_*🎭
`,


                headerType: 4,

            };

            return Void.sendMessage(citel.chat, buttonMessage, {

                quoted: citel,

            });

        }

    )

//---------------------------------------------------------------------------

cmd({

            pattern: "menu",

            desc: "(menu cmdlist).",

            category: "list",

            react: "🎲",

            filename: __filename,

            use: '<faded-Alan walker.>',

        },

        async(Void, citel, text) => {

         

            let buttons = [{

                    buttonId: `${prefix}system`,

                    buttonText: {

                        displayText: "System",

                    },

                    type: 1,

                },

                  {

                    buttonId: `${prefix}ping`,

                    buttonText: {

                        displayText: "Ping",

                    },

                    type: 1,

                },

            ];

            let buttonMessage = {

                image: {

                    url: 'https://telegra.ph/file/b14abd862b0bf132a2b5e.jpg',

                },

                caption: `
❍═════════════════════❍
    *_𝙳𝙰𝚁𝙺 𝚀𝚄𝙴𝙴𝙽 𝙼𝙴𝙽𝚄 𝙻𝙸𝚂𝚃_*
   ✦╾╾╾╾╾╾╾╾╾╾╾╾╾╾╾╾✦

┏⃞❑⃝🦹⃟➥.1 *ᴅᴏᴡɴʟᴏᴅᴇʀ ᴍᴇɴᴜ*
┃
┣⃞❑⃝🦸⃟➥.2 *ɢᴇɴᴇʀᴀʟ ᴍᴇɴᴜ*
┃
┣⃞❑⃝🧞‍♀️⃟➥.3 *ɢʀᴏᴜᴘ ᴍᴇɴᴜ*
┃
┣⃞❑⃝🧜‍♂️⃟➥.4 *ᴛᴇxᴛᴘʀᴏ ᴍᴇɴᴜ*
┃
┣⃞❑⃝🧜‍♀️⃟➥.5 *ᴄᴏɴᴠᴇʀᴛᴇʀ ᴍᴇɴᴜ*
┃
┣⃞❑⃝🍁⃟➥.6 *ᴏᴡɴᴇʀ ᴍᴇɴᴜ*
┃
┣⃞❑⃝💕⃟➥.7 *ɴᴇᴡꜱ ᴍᴇɴᴜ*
┃
┣⃞❑⃝🧚‍♂️⃟➥.8 *ɢᴀᴍᴇ ᴍᴇɴᴜ*
┃
┣⃞❑⃝🎩⃟➥.9 *ᴀᴜᴅɪᴏ ᴍᴇɴᴜ*
┃
┣⃞❑⃝🎭⃟➥.10 *ꜱᴛɪᴄᴋᴇʀ ᴍᴇɴᴜ*
┃
┣⃞❑⃝🦂⃟➥.11 *ᴀʟʟ ᴍᴇɴᴜ*
┃
┣⃞❑⃝❄️⃟➥.12 *ꜱᴇᴀʀᴄʜ ᴍᴇɴᴜ*
┃
┣⃞❑⃝🐲⃟➥.13 *ɴꜱꜰᴡ ᴍᴇɴᴜ*
┃
┣⃞❑⃝😈⃟➥.14 *ʀᴇᴀᴄᴛɪᴏɴ ᴍᴇɴᴜ*
┃
┣⃞❑⃝🐍⃟➥.15 *ᴍᴏᴅᴇʀᴀᴛɪᴏɴ ᴍᴇɴᴜ*
┃
┣⃞❑⃝🌿⃟➥.16 *ɢᴇɴ ᴍᴇɴᴜ*
┃
┣⃞❑⃝🐉⃟➥.17 *ᴡᴇᴇʙ ᴍᴇɴᴜ*
┃
┗⃞❑⃝🔖⃟➥.18 *ᴍɪꜱᴄ ᴍᴇɴᴜ*
❍═════════════════════❍
🎩 *_ᴅᴀʀᴋ Qᴜᴇᴇɴ ᴍᴅ_*🎩
🎭 *_ᴄʀᴇᴀᴛᴇᴅ ʙʏ ᴅᴀʀᴋ Qᴜᴇᴇɴ ᴛᴇᴀᴍ_*🎭
`,

                footer: tlang().footer,


                headerType: 4,

            };

            return Void.sendMessage(citel.chat, buttonMessage, {

                quoted: citel,

            });

        }

    )

//---------------------------------------------------------------------------

cmd({

            pattern: "2",
            alias: [""],

            desc: "(menu cmdlist).",

            category: "list",

            react: "🌐",

            filename: __filename,

            use: '<faded-Alan walker.>',

        },

        async(Void, citel, text) => {


            let buttonMessage = {

                image: {

                    url: 'https://telegra.ph/file/8d8bffc2900105e73353b.jpg',

                },

                caption: `
┏━━━━━━━━━━━━━━━✦
┃ ┌╼╼╼╼╼╼╼╼╼╼●
┃ │ *𝙶𝙴𝙽𝙴𝚁𝙰𝙻 𝙲𝙾𝙼𝙼𝙰𝙽𝙳𝚂*
┃ ├╼╼╼╼╼╼╼╼╼╼●
┃ ├❑🐉⃟➤ᴀʟɪᴠᴇ
┃ ├❑🐉⃟➤ʟᴇᴀᴅᴇʀʙᴏᴀʀᴅ
┃ ├❑🐉⃟➤ꜱᴛᴀᴛᴜꜱ
┃ ├❑🐉⃟➤ꜱʏꜱᴛᴇᴍ
┃ ├❑🐉⃟➤ʜᴇʟᴘ
┃ ├❑🐉⃟➤ʟɪꜱᴛ
┃ ├❑🐉⃟➤ᴏᴡɴᴇʀ
┃ ├❑🐉⃟➤ꜰɪʟᴇ
┃ ├❑🐉⃟➤ᴘɪɴɢ
┃ ├❑🐉⃟➤ᴀʟɪᴠᴇ
┃ └╼╼╼╼╼╼╼╼╼╼●
┗━━━━━━━━━━━━━━━✦
🎩 *_ᴅᴀʀᴋ Qᴜᴇᴇɴ ᴍᴅ_*🎩
🎭 *_ᴄʀᴇᴀᴛᴇᴅ ʙʏ ᴅᴀʀᴋ Qᴜᴇᴇɴ ᴛᴇᴀᴍ_*🎭
`,

                footer: tlang().footer,


                headerType: 4,

            };

            return Void.sendMessage(citel.chat, buttonMessage, {

                quoted: citel,

            });

        }

    )

//---------------------------------------------------------------------------

cmd({

            pattern: "5",

            desc: "(menu cmdlist).",

            category: "list",

            react: "🦹",

            filename: __filename,

            use: '<faded-Alan walker.>',

        },

        async(Void, citel, text) => {

         

            let buttonMessage = {

                image: {

                    url: 'https://telegra.ph/file/bfd861d4d9c4bb75c627c.jpg',

                },

                caption: `

┏━━━━━━━━━━━━━━━✦
┃ ┌╼╼╼╼╼╼╼╼╼╼●
┃ │ *𝙲𝙾𝙽𝚅𝙴𝚁𝚃𝙴𝚁 𝙲𝙾𝙼𝙼𝙰𝙽𝙳𝚂*
┃ ├╼╼╼╼╼╼╼╼╼╼●
┃ ├❑🧚‍♀️⃟➤ᴘᴀꜱᴛᴇʙɪɴ
┃ ├❑🧚‍♀️⃟➤ᴘᴀꜱᴛᴇ
┃ ├❑🧚‍♀️⃟➤ᴘʜᴏᴛᴏ
┃ ├❑🧚‍♀️⃟➤ϙᴜᴏᴛᴇʟʏ
┃ ├❑🧚‍♀️⃟➤ꜰᴀɴᴄʏ
┃ ├❑🧚‍♀️⃟➤ᴛɪɴʏ
┃ ├❑🧚‍♀️⃟➤ᴛᴏᴀᴜᴅɪᴏ
┃ └╼╼╼╼╼╼╼╼╼╼●
┗━━━━━━━━━━━━━━━✦
🎩 *_ᴅᴀʀᴋ Qᴜᴇᴇɴ ᴍᴅ_*🎩
🎭 *_ᴄʀᴇᴀᴛᴇᴅ ʙʏ ᴅᴀʀᴋ Qᴜᴇᴇɴ ᴛᴇᴀᴍ_*🎭
`,


                headerType: 4,

            };

            return Void.sendMessage(citel.chat, buttonMessage, {

                quoted: citel,

            });

        }

    )

//---------------------------------------------------------------------------
cmd({

            pattern: "6",

            desc: "(menu cmdlist).",

            category: "list",

            react: "🧚‍♀️",

            filename: __filename,

            use: '<faded-Alan walker.>',

        },

        async(Void, citel, text) => {

         

            let buttons = [{

                    buttonId: `${prefix}system`,

                    buttonText: {

                        displayText: "System",

                    },

                    type: 1,

                },

                  {

                    buttonId: `${prefix}ping`,

                    buttonText: {

                        displayText: "Ping",

                    },

                    type: 1,

                },

            ];

            let buttonMessage = {

                image: {

                    url: await botpic(),

                },

                caption: `
┏━━━━━━━━━━━━━━━✦
┃ ┌╼╼╼╼╼╼╼╼╼╼●
┃ │ *𝙾𝚆𝙽𝙴𝚁 𝙲𝙾𝙼𝙼𝙰𝙽𝙳𝚂*
┃ ├╼╼╼╼╼╼╼╼╼╼●
┃ ├🧜‍♂️⃟➤ᴊᴏɪɴ
┃ ├🧜‍♂️⃟➤ᴜɴʙʟᴏᴄᴋ
┃ ├🧜‍♂️⃟➤ᴜᴊɪᴅ
┃ ├🧜‍♂️⃟➤ʙʟᴏᴄᴋ
┃ ├🧜‍♂️⃟➤.
┃ ├🧜‍♂️⃟➤ᴀᴅᴅɴᴏᴛᴇ
┃ ├🧜‍♂️⃟➤ϙʀ
┃ ├🧜‍♂️⃟➤ꜱʜᴇʟʟ
┃ ├🧜‍♂️⃟➤ᴇᴠᴀʟ
┃ ├🧜‍♂️⃟➤ᴅᴇʟɴᴏᴛᴇ
┃ ├🧜‍♂️⃟➤ᴅᴇʟᴀʟʟɴᴏᴛᴇꜱ
┃ ├🧜‍♂️⃟➤ʙᴀɴ
┃ ├🧜‍♂️⃟➤ᴀʟʟɴᴏᴛᴇꜱ
┃ └╼╼╼╼╼╼╼╼╼╼●
┗━━━━━━━━━━━━━━━✦
🎩 *_ᴅᴀʀᴋ Qᴜᴇᴇɴ ᴍᴅ_*🎩
🎭 *_ᴄʀᴇᴀᴛᴇᴅ ʙʏ ᴅᴀʀᴋ Qᴜᴇᴇɴ ᴛᴇᴀᴍ_*🎭
`,

                footer: tlang().footer,


                headerType: 4,

            };

            return Void.sendMessage(citel.chat, buttonMessage, {

                quoted: citel,

            });

        }

    )

//---------------------------------------------------------------------------

cmd({

            pattern: "7",

            desc: "(menu cmdlist).",

            category: "downloader",

            react: "🎭",

            filename: __filename,

            use: '<faded-Alan walker.>',

        },

        async(Void, citel, text) => {

         

            let buttons = [{

                    buttonId: `${prefix}git`,

                    buttonText: {

                        displayText: "Github",

                    },

                    type: 1,

                },

                  {

                    buttonId: `${prefix}system`,

                    buttonText: {

                        displayText: "Info",

                    },

                    type: 1,

                },

            ];

            let buttonMessage = {

                image: {

                    url: await botpic(),

                },

                caption: `
┏━━━━━━━━━━━━━━━✦
┃ ┌╼╼╼╼╼╼╼╼╼╼●
┃ │ *𝙽𝙴𝚆𝚂 𝙲𝙾𝙼𝙼𝙰𝙽𝙳𝚂*
┃ ├╼╼╼╼╼╼╼╼╼╼●
┃ ├❑💃⃟➤ʜɪʀᴜɴᴇᴡꜱ
┃ ├❑💃⃟➤ɴᴀꜱᴀ
┃ ├❑💃⃟➤ᴇꜱᴀɴᴀ
┃ ├❑💃⃟➤ꜱɪʀᴀꜱᴀ
┃ ├❑💃⃟➤ɪᴏꜱ
┃ └╼╼╼╼╼╼╼╼╼╼●
┗━━━━━━━━━━━━━━━✦
🎩 *_ᴅᴀʀᴋ Qᴜᴇᴇɴ ᴍᴅ_*🎩
🎭 *_ᴄʀᴇᴀᴛᴇᴅ ʙʏ ᴅᴀʀᴋ Qᴜᴇᴇɴ ᴛᴇᴀᴍ_*🎭
`,

                footer: tlang().footer,

                buttons: buttons,

                headerType: 4,

            };

            return Void.sendMessage(citel.chat, buttonMessage, {

                quoted: citel,

            });

        }

    )

    

    

    //---------------------------------------------------------------------------

cmd({

            pattern: "8",
            
            alias: ["&8"],

            desc: "(menu cmdlist).",

            category: "downloader",

            react: "🔖",

            filename: __filename,

            use: '<faded-Alan walker.>',

        },

        async(Void, citel, text) => {


            let buttonMessage = {

                image: {

                    url: await botpic(),

                },

                caption: `
┏━━━━━━━━━━━━━━━✦
┃ ┌╼╼╼╼╼╼╼╼╼╼●
┃ │ *𝙶𝙰𝙼𝙴 𝙼𝙴𝙽𝚄*
┃ ├╼╼╼╼╼╼╼╼╼╼●
┃ ├❑💭⃟➤ᴅɪᴄᴇ
┃ ├❑💭⃟➤ᴅᴇʟᴛᴛᴛ
┃ ├❑💭⃟➤ᴛᴛᴛ
┃ └╼╼╼╼╼╼╼╼╼╼●
┖━━━━━━━━━━━━━━━✦
🎩 *_ᴅᴀʀᴋ Qᴜᴇᴇɴ ᴍᴅ_*🎩
🎭 *_ᴄʀᴇᴀᴛᴇᴅ ʙʏ ᴅᴀʀᴋ Qᴜᴇᴇɴ ᴛᴇᴀᴍ_*🎭
`,

                footer: tlang().footer,


                headerType: 4,

            };

            return Void.sendMessage(citel.chat, buttonMessage, {

                quoted: citel,

            });

        }

    )

//---------------------------------------------------------------------------

cmd({

            pattern: "9",

            desc: "(menu cmdlist).",

            category: "downloader",

            react: "🧞‍♀️",

            filename: __filename,

            use: '<faded-Alan walker.>',

        },

        async(Void, citel, text) => {

         

            let buttonMessage = {

                image: {

                    url: await botpic(),

                },

                caption: `

┏━━━━━━━━━━━━━━━━✦
┃ ┌╼╼╼╼╼╼╼╼╼╼●
┃ │ *𝙰𝚄𝙳𝙸𝙾 𝙼𝙴𝙽𝚄*
┃ ├╼╼╼╼╼╼╼╼╼╼●
┃ ├🧜‍♂️⃟➤ʙᴀꜱꜱ
┃ ├🧜‍♂️⃟➤ʙʟᴏᴡɴ
┃ ├🧜‍♂️⃟➤ᴅᴇᴇᴘ
┃ ├🧜‍♂️⃟➤ꜰᴀꜱᴛ
┃ ├🧜‍♂️⃟➤ʀᴇᴠᴇʀꜱᴇ
┃ └╼╼╼╼╼╼╼╼╼╼●
┗━━━━━━━━━━━━━━━✦
🎩 *_ᴅᴀʀᴋ Qᴜᴇᴇɴ ᴍᴅ_*🎩
🎭 *_ᴄʀᴇᴀᴛᴇᴅ ʙʏ ᴅᴀʀᴋ Qᴜᴇᴇɴ ᴛᴇᴀᴍ_*🎭
`,


                headerType: 4,

            };

            return Void.sendMessage(citel.chat, buttonMessage, {

                quoted: citel,

            });

        }

    )

//---------------------------------------------------------------------------

cmd({

            pattern: "10",

            desc: "(menu cmdlist).",

            category: "downloader",

            react: "👨‍💻",

            filename: __filename,

            use: '<faded-Alan walker.>',

        },

        async(Void, citel, text,{isCreator}) => {

         

            let buttons = [{

                    buttonId: `${prefix}owner`,

                    buttonText: {

                        displayText: "Owner",

                    },

                    type: 1,

                },

                  {

                    buttonId: `${prefix}git`,

                    buttonText: {

                        displayText: "Deploy Site",

                    },

                    type: 1,

                },

            ];

            let buttonMessage = {

                image: {

                    url: await botpic(),

                },

                caption: `
┏━━━━━━━━━━━━━━━✦
┃ ┌╼╼╼╼╼╼╼╼╼╼●
┃ │ *𝚂𝚃𝙸𝙲𝙺𝙴𝚁 𝙼𝙴𝙽𝚄*
┃ ├╼╼╼╼╼╼╼╼╼╼●
┃ ├❑🍁⃟➤ᴄɪʀᴄʟᴇ
┃ ├❑🍁⃟➤ᴄʀᴏᴘ
┃ ├❑🍁⃟➤ʀᴏᴜɴᴅ
┃ ├❑🍁⃟➤ᴀᴛᴛᴘ
┃ ├❑🍁⃟➤ᴛᴛᴘ
┃ ├❑🍁⃟➤ꜱᴛᴇᴀʟ
┃ └╼╼╼╼╼╼╼╼╼╼●
┗━━━━━━━━━━━━━━━✦
🎩 *_ᴅᴀʀᴋ Qᴜᴇᴇɴ ᴍᴅ_*🎩
🎭 *_ᴄʀᴇᴀᴛᴇᴅ ʙʏ ᴅᴀʀᴋ Qᴜᴇᴇɴ ᴛᴇᴀᴍ_*🎭
`,

                footer: tlang().footer,

                buttons: buttons,

                headerType: 4,

            };

            return Void.sendMessage(citel.chat, buttonMessage, {

                quoted: citel,

            });

        }

    )

//---------------------------------------------------------------------------

cmd({

            pattern: "11",

            desc: "(menu cmdlist).",

            category: "downloader",

            react: "🎊",

            filename: __filename,

            use: '<faded-Alan walker.>',

        },

        async(Void, citel, text) => {

         

            let buttons = [{

                    buttonId: `${prefix}Owner`,

                    buttonText: {

                        displayText: "Owner",

                    },

                    type: 1,

                },

                  {

                    buttonId: `${prefix}install https://gist.github.com/prabathLK/01f3859256a7130f234ac54aeebf486e/raw`,

                    buttonText: {

                        displayText: "Install Voice Reply",

                    },

                    type: 1,

                },

            ];

            let buttonMessage = {

                image: {

                    url: await botpic(),

                },

                caption: `

┏━━━━━━━━━━━━━━━✦
┃ ┌╼╼╼╼╼╼╼╼╼╼●
┃ │ ●❮⃟🧚‍♂️ᴍɪꜱᴄ🧚‍♂️⃟❯●
┃ ├╼╼╼╼╼╼╼╼╼╼●
┃ ├🧜‍♂️⃟➤ꜰʙ
┃ ├🧜‍♂️⃟➤ᴛɪᴋᴛᴏᴋ
┃ ├🧜‍♂️⃟➤ᴠᴠ
┃ ├🧜‍♂️⃟➤ᴄʜᴀᴛ
┃ ├🧜‍♂️⃟➤ᴅᴀʟʟᴇ
┃ ├🧜‍♂️⃟➤ʀᴇᴘᴏ
┃ ├🧜‍♂️⃟➤ꜱᴛᴀᴛᴜꜱ
┃ ├🧜‍♂️⃟➤ᴛʜᴇᴍᴇ
┃ ├🧜‍♂️⃟➤ꜱᴇᴛᴡᴇʟᴄᴏᴍᴇ
┃ ├🧜‍♂️⃟➤ꜱᴇᴛɢᴏᴏᴅʙʏᴇ
┃ ├🧜‍♂️⃟➤ᴇxᴇᴄ
┃ ├🧜‍♂️⃟➤ʀᴇᴀᴅᴍᴏʀᴇ
┃ ├🧜‍♂️⃟➤ᴜᴘᴛɪᴍᴇ
┃ ├🧜‍♂️⃟➤ᴡᴍ
┃ ├🧜‍♂️⃟➤ᴘɪᴄᴋ
┃ ├🧜‍♂️⃟➤ꜰʟɪᴘᴛᴇxᴛ
┃ ├🧜‍♂️⃟➤ᴍᴘ4ꜰʀᴏᴍᴜʀʟ
┃ ├🧜‍♂️⃟➤ᴇᴍɪx
┃ ├🧜‍♂️⃟➤ᴄʜᴀᴛʙᴏᴛ
┃ ├🧜‍♂️⃟➤ᴇʙɪɴᴀʀʏ
┃ ├🧜‍♂️⃟➤ᴅʙɪɴᴀʀʏ
┃ ├🧜‍♂️⃟➤ʙᴏᴛ
┃ ├🧜‍♂️⃟➤ᴜɴʙᴀɴ
┃ ├🧜‍♂️⃟➤ᴜʀʟ
┃ ├🧜‍♂️⃟➤ᴛʀᴛ
┃ ├🧜‍♂️⃟➤ᴜᴘᴅᴀᴛᴇ
┃ └╼╼╼╼╼╼╼╼╼╼●
┏━━━━━━━━━━━━━━━✦
┃ ┌╼╼╼╼╼╼╼╼╼╼●
┃ │ ●❮⃟🧚‍♂️ɢᴇɴᴇʀᴀʟ🧚‍♂️⃟❯●
┃ ├╼╼╼╼╼╼╼╼╼╼●
┃ ├🧜‍♂️⃟➤ᴀʟɪᴠᴇ
┃ ├🧜‍♂️⃟➤ʟᴇᴀᴅᴇʀʙᴏᴀʀᴅ
┃ ├🧜‍♂️⃟➤ꜱᴛᴀᴛᴜꜱ
┃ ├🧜‍♂️⃟➤ʜᴇʟᴘ
┃ ├🧜‍♂️⃟➤ʟɪꜱᴛ
┃ ├🧜‍♂️⃟➤ᴏᴡɴᴇʀ
┃ ├🧜‍♂️⃟➤ꜰɪʟᴇ
┃ ├🧜‍♂️⃟➤ᴘɪɴɢ
┃ ├🧜‍♂️⃟➤ᴀʟɪᴠᴇ
┃ └╼╼╼╼╼╼╼╼╼╼●
┏━━━━━━━━━━━━━━━✦
┃ ┌╼╼╼╼╼╼╼╼╼╼●
┃ │ ●❮⃟🧚‍♂️ᴅᴏᴡɴʟᴏᴀᴅᴇʀ🧚‍♂️⃟❯●
┃ ├╼╼╼╼╼╼╼╼╼╼●
┃ ├🧜‍♂️⃟➤ᴅᴏᴡɴᴀᴘᴋ
┃ ├🧜‍♂️⃟➤ɪᴏꜱ
┃ ├🧜‍♂️⃟➤ɪᴏꜱᴛ
┃ ├🧜‍♂️⃟➤ɴᴀꜱᴀ
┃ ├🧜‍♂️⃟➤ᴡᴀʙᴇᴛᴀ
┃ ├🧜‍♂️⃟➤ᴛᴛꜱ
┃ ├🧜‍♂️⃟➤ʏᴛꜱ
┃ ├🧜‍♂️⃟➤ᴠɪᴅᴇᴏ
┃ ├🧜‍♂️⃟➤ᴘʟᴀʏ
┃ ├🧜‍♂️⃟➤ʀɪɴɢᴛᴏɴᴇ
┃ ├🧜‍♂️⃟➤ᴘɪɴᴛ
┃ ├🧜‍♂️⃟➤ᴍᴇᴅɪᴀꜰɪʀᴇ
┃ ├🧜‍♂️⃟➤ʏᴛᴍᴘ4
┃ ├🧜‍♂️⃟➤ʏᴛᴍᴘ3
┃ ├🧜‍♂️⃟➤ʏᴛᴅᴏᴄ
┃ ├🧜‍♂️⃟➤ꜱꜱ
┃ ├🧜‍♂️⃟➤ꜰʙ
┃ ├🧜‍♂️⃟➤ᴛɪᴋᴛᴏᴋ
┃ ├🧜‍♂️⃟➤ᴛᴠɪᴅᴇᴏ
┃ ├🧜‍♂️⃟➤ꜰʙꜱ
┃ ├🧜‍♂️⃟➤ᴅᴀᴅᴜ
┃ ├🧜‍♂️⃟➤ᴛᴛᴘ
┃ ├🧜‍♂️⃟➤ᴠɪᴅᴇᴏ3
┃ ├🧜‍♂️⃟➤ᴛᴇꜱᴛꜱᴏɴɢ
┃ ├🧜‍♂️⃟➤ᴀᴛᴛᴘ
┃ ├🧜‍♂️⃟➤ᴛɪᴋᴛᴏᴋ
┃ ├🧜‍♂️⃟➤ᴘʟᴀʏʟɪꜱᴛ
┃ └╼╼╼╼╼╼╼╼╼╼●
┏━━━━━━━━━━━━━━━✦
┃ ┌╼╼╼╼╼╼╼╼╼╼●
┃ │ ●❮⃟🧚‍♂️ᴅᴀʀᴋϙᴜᴇᴇɴ🧚‍♂️⃟❯●
┃ ├╼╼╼╼╼╼╼╼╼╼●
┃ ├🧜‍♂️⃟➤ɢɪᴛ
┃ ├🧜‍♂️⃟➤ꜱɪʀᴀꜱᴀ
┃ ├🧜‍♂️⃟➤ᴇꜱᴀɴᴀ
┃ ├🧜‍♂️⃟➤ꜰɪɴᴅ
┃ ├🧜‍♂️⃟➤ʜɪʀᴜɴᴇᴡꜱ
┃ └╼╼╼╼╼╼╼╼╼╼●
┏━━━━━━━━━━━━━━━✦
┃ ┌╼╼╼╼╼╼╼╼╼╼●
┃ │ ●❮⃟🧚‍♂️ᴏᴡɴᴇʀ🧚‍♂️⃟❯●
┃ ├╼╼╼╼╼╼╼╼╼╼●
┃ ├🧜‍♂️⃟➤ᴊᴏɪɴ
┃ ├🧜‍♂️⃟➤ᴜɴʙʟᴏᴄᴋ
┃ ├🧜‍♂️⃟➤ᴜᴊɪᴅ
┃ ├🧜‍♂️⃟➤ʙʟᴏᴄᴋ
┃ ├🧜‍♂️⃟➤.
┃ ├🧜‍♂️⃟➤ᴀᴅᴅɴᴏᴛᴇ
┃ ├🧜‍♂️⃟➤ϙʀ
┃ ├🧜‍♂️⃟➤ꜱʜᴇʟʟ
┃ ├🧜‍♂️⃟➤ᴇᴠᴀʟ
┃ ├🧜‍♂️⃟➤ᴅᴇʟɴᴏᴛᴇ
┃ ├🧜‍♂️⃟➤ᴅᴇʟᴀʟʟɴᴏᴛᴇꜱ
┃ ├🧜‍♂️⃟➤ʙᴀɴ
┃ ├🧜‍♂️⃟➤ᴀʟʟɴᴏᴛᴇꜱ
┃ └╼╼╼╼╼╼╼╼╼╼●
┏━━━━━━━━━━━━━━━✦
┃ ┌╼╼╼╼╼╼╼╼╼╼●
┃ │ ●❮⃟🧚‍♂️ɢʀᴏᴜᴘ🧚‍♂️⃟❯●
┃ ├╼╼╼╼╼╼╼╼╼╼●
┃ ├🧜‍♂️⃟➤ꜱᴛɪᴄᴋᴇʀ
┃ ├🧜‍♂️⃟➤ꜱᴜᴘᴘᴏʀᴛ
┃ ├🧜‍♂️⃟➤ᴡᴀʀɴ
┃ ├🧜‍♂️⃟➤ᴛᴀɢᴀʟʟ
┃ ├🧜‍♂️⃟➤ʀᴇϙᴜᴇꜱᴛ
┃ ├🧜‍♂️⃟➤ʀᴇᴛʀɪᴠᴇ
┃ ├🧜‍♂️⃟➤ʀᴇꜱᴇᴛᴡᴀʀɴ
┃ ├🧜‍♂️⃟➤ᴘᴏʟʟ
┃ ├🧜‍♂️⃟➤ᴘʀᴏꜰɪʟᴇ
┃ ├🧜‍♂️⃟➤ʀᴀɴᴋ
┃ ├🧜‍♂️⃟➤ᴘʀᴏᴍᴏᴛᴇ
┃ ├🧜‍♂️⃟➤ᴋɪᴄᴋ
┃ ├🧜‍♂️⃟➤ᴍᴇᴍᴇɢᴇɴ
┃ ├🧜‍♂️⃟➤ɢʀᴏᴜᴘ
┃ ├🧜‍♂️⃟➤ɢʀᴏᴜᴘᴘɪᴄ
┃ ├🧜‍♂️⃟➤ʜɪᴅᴇᴛᴀɢ
┃ ├🧜‍♂️⃟➤ᴀᴅᴅ
┃ ├🧜‍♂️⃟➤ɢᴇᴛᴊɪᴅꜱ
┃ ├🧜‍♂️⃟➤ᴅᴇᴍᴏᴛᴇ
┃ ├🧜‍♂️⃟➤ᴅᴇʟ
┃ ├🧜‍♂️⃟➤ᴄʜᴇᴄᴋᴡᴀʀɴ
┃ ├🧜‍♂️⃟➤ʙʀᴏᴀᴅᴄᴀꜱᴛ
┃ ├🧜‍♂️⃟➤ᴀɴᴛɪʟɪɴᴋ
┃ ├🧜‍♂️⃟➤ᴀᴄᴛ
┃ ├🧜‍♂️⃟➤ᴅᴇᴀᴄᴛ
┃ └╼╼╼╼╼╼╼╼╼╼●
┏━━━━━━━━━━━━━━━✦
┃ ┌╼╼╼╼╼╼╼╼╼╼●
┃ │ ●❮⃟🧚‍♂️➀➇+ᴠɪᴅᴇᴏꜱ🧚‍♂️⃟❯●
┃ ├╼╼╼╼╼╼╼╼╼╼●
┃ ├🧜‍♂️⃟➤xɴxx
┃ └╼╼╼╼╼╼╼╼╼╼●
┏━━━━━━━━━━━━━━━✦
┃ ┌╼╼╼╼╼╼╼╼╼╼●
┃ │ ●❮⃟🧚‍♂️ᴛᴇxᴛᴘʀᴏ🧚‍♂️⃟❯●
┃ ├╼╼╼╼╼╼╼╼╼╼●
┃ ├🧜‍♂️⃟➤ᴅᴇᴇᴘꜱᴇᴀ
┃ ├🧜‍♂️⃟➤ʜᴏʀʀᴏʀ
┃ ├🧜‍♂️⃟➤ᴡʜɪᴛᴇʙᴇᴀʀ
┃ ├🧜‍♂️⃟➤ᴊᴏᴋᴇʀ
┃ ├🧜‍♂️⃟➤ᴍᴇᴛᴀʟʟɪᴄ
┃ ├🧜‍♂️⃟➤ꜱᴛᴇᴇʟ
┃ ├🧜‍♂️⃟➤ʜᴀʀʀʏᴘᴏᴛᴛᴇʀ
┃ ├🧜‍♂️⃟➤ᴜɴᴅᴇʀᴡᴀᴛᴇʀ
┃ ├🧜‍♂️⃟➤ʟᴜxᴜʀʏ
┃ ├🧜‍♂️⃟➤ɢʟᴜᴇ
┃ ├🧜‍♂️⃟➤ꜰᴀʙʀɪᴄ
┃ ├🧜‍♂️⃟➤ᴛᴏxɪᴄ
┃ ├🧜‍♂️⃟➤ᴀɴᴄɪᴇɴᴛ
┃ ├🧜‍♂️⃟➤ᴄʟᴏᴜᴅ
┃ ├🧜‍♂️⃟➤ᴛʀᴀɴꜱꜰᴏʀᴍᴇʀ
┃ ├🧜‍♂️⃟➤ᴛʜᴜɴᴅᴇʀ
┃ ├🧜‍♂️⃟➤ꜱᴄɪꜰɪ
┃ ├🧜‍♂️⃟➤ꜱᴀɴᴅ
┃ ├🧜‍♂️⃟➤ʀᴀɪɴʙᴏᴡ
┃ ├🧜‍♂️⃟➤ᴘᴇɴᴄɪʟ
┃ ├🧜‍♂️⃟➤ɴᴇᴏɴ
┃ ├🧜‍♂️⃟➤ᴍᴀɢᴍᴀ
┃ ├🧜‍♂️⃟➤ʟᴇᴀᴠᴇꜱ
┃ ├🧜‍♂️⃟➤ɢʟɪᴛᴄʜ
┃ ├🧜‍♂️⃟➤ᴅɪꜱᴄᴏᴠᴇʀʏ
┃ ├🧜‍♂️⃟➤ᴄʜʀɪꜱᴛᴍᴀꜱ
┃ ├🧜‍♂️⃟➤ᴄᴀɴᴅʏ
┃ ├🧜‍♂️⃟➤1917
┃ ├🧜‍♂️⃟➤ɴᴇᴡᴛᴇxᴛ
┃ ├🧜‍♂️⃟➤ʙʟᴀᴄᴋᴘɪɴᴋ
┃ └╼╼╼╼╼╼╼╼╼╼●
┏━━━━━━━━━━━━━━━✦
┃ ┌╼╼╼╼╼╼╼╼╼╼●
┃ │ ●❮⃟🧚‍♂️ᴄᴏɴᴠᴇʀᴛᴇʀ🧚‍♂️⃟❯●
┃ ├╼╼╼╼╼╼╼╼╼╼●
┃ ├🧜‍♂️⃟➤ᴘᴀꜱᴛᴇʙɪɴ
┃ ├🧜‍♂️⃟➤ᴘᴀꜱᴛᴇ
┃ ├🧜‍♂️⃟➤ᴘʜᴏᴛᴏ
┃ ├🧜‍♂️⃟➤ϙᴜᴏᴛᴇʟʏ
┃ ├🧜‍♂️⃟➤ꜰᴀɴᴄʏ
┃ ├🧜‍♂️⃟➤ᴛɪɴʏ
┃ ├🧜‍♂️⃟➤ᴛᴏᴀᴜᴅɪᴏ
┃ └╼╼╼╼╼╼╼╼╼╼●
┏━━━━━━━━━━━━━━━✦
┃ ┌╼╼╼╼╼╼╼╼╼╼●
┃ │ ●❮⃟🧚‍♂️ɢᴀᴍᴇ🧚‍♂️⃟❯●
┃ ├╼╼╼╼╼╼╼╼╼╼●
┃ ├🧜‍♂️⃟➤ᴅɪᴄᴇ
┃ ├🧜‍♂️⃟➤ᴅᴇʟᴛᴛᴛ
┃ ├🧜‍♂️⃟➤ᴛᴛᴛ
┃ └╼╼╼╼╼╼╼╼╼╼●
┏━━━━━━━━━━━━━━━✦
┃ ┌╼╼╼╼╼╼╼╼╼╼●
┃ │ ●❮⃟🧚‍♂️ꜰᴜɴ🧚‍♂️⃟❯●
┃ ├╼╼╼╼╼╼╼╼╼╼●
┃ ├🧜‍♂️⃟➤ꜱʜɪᴘ
┃ └╼╼╼╼╼╼╼╼╼╼●
┏━━━━━━━━━━━━━━━✦
┃ ┌╼╼╼╼╼╼╼╼╼╼●
┃ │ ●❮⃟🧚‍♂️ꜱᴛɪᴄᴋᴇʀ🧚‍♂️⃟❯●
┃ ├╼╼╼╼╼╼╼╼╼╼●
┃ ├🧜‍♂️⃟➤ᴄɪʀᴄʟᴇ
┃ ├🧜‍♂️⃟➤ᴄʀᴏᴘ
┃ ├🧜‍♂️⃟➤ʀᴏᴜɴᴅ
┃ ├🧜‍♂️⃟➤ᴀᴛᴛᴘ
┃ ├🧜‍♂️⃟➤ᴛᴛᴘ
┃ ├🧜‍♂️⃟➤ꜱᴛᴇᴀʟ
┃ └╼╼╼╼╼╼╼╼╼╼●
┏━━━━━━━━━━━━━━━✦
┃ ┌╼╼╼╼╼╼╼╼╼╼●
┃ │ ●❮⃟🧚‍♂️ᴀᴜᴅɪᴏ🧚‍♂️⃟❯●
┃ ├╼╼╼╼╼╼╼╼╼╼●
┃ ├🧜‍♂️⃟➤ʙᴀꜱꜱ
┃ ├🧜‍♂️⃟➤ʙʟᴏᴡɴ
┃ ├🧜‍♂️⃟➤ᴅᴇᴇᴘ
┃ ├🧜‍♂️⃟➤ꜰᴀꜱᴛ
┃ ├🧜‍♂️⃟➤ʀᴇᴠᴇʀꜱᴇ
┃ └╼╼╼╼╼╼╼╼╼╼●
┏━━━━━━━━━━━━━━━✦
┃ ┌╼╼╼╼╼╼╼╼╼╼●
┃ │ ●❮⃟🧚‍♂️ᴅᴏᴡɴʟᴏᴅᴇʀ🧚‍♂️⃟❯●
┃ ├╼╼╼╼╼╼╼╼╼╼●
┃ ├🧜‍♂️⃟➤ᴀᴜᴅɪᴏ
┃ └╼╼╼╼╼╼╼╼╼╼●
┏━━━━━━━━━━━━━━━✦
┃ ┌╼╼╼╼╼╼╼╼╼╼●
┃ │ ●❮⃟🧚‍♂️ᴅᴏᴡɴʟᴏᴀᴅ🧚‍♂️⃟❯●
┃ ├╼╼╼╼╼╼╼╼╼╼●
┃ ├🧜‍♂️⃟➤ᴡᴀʙᴇᴛᴀɪɴꜰᴏ
┃ └╼╼╼╼╼╼╼╼╼╼●
┏━━━━━━━━━━━━━━━✦
┃ ┌╼╼╼╼╼╼╼╼╼╼●
┃ │ ●❮⃟🧚‍♂️ᴇᴄᴏɴᴏᴍʏ🧚‍♂️⃟❯●
┃ ├╼╼╼╼╼╼╼╼╼╼●
┃ ├🧜‍♂️⃟➤ᴅᴀɪʟʏ
┃ ├🧜‍♂️⃟➤ʀᴇꜱᴇᴛᴡᴀʟʟᴇᴛ
┃ ├🧜‍♂️⃟➤ᴄᴀᴘᴀᴄɪᴛʏ
┃ ├🧜‍♂️⃟➤ᴅᴇᴘᴏꜱɪᴛ
┃ ├🧜‍♂️⃟➤ʟʙ
┃ ├🧜‍♂️⃟➤ᴛʀᴀɴꜱꜰᴇʀ
┃ ├🧜‍♂️⃟➤ᴡᴀʟʟᴇᴛ
┃ ├🧜‍♂️⃟➤ɢɪᴠᴇ
┃ ├🧜‍♂️⃟➤ʙᴀɴᴋ
┃ ├🧜‍♂️⃟➤ʀᴏʙ
┃ ├🧜‍♂️⃟➤ᴡɪᴛʜᴅʀᴀᴡ
┃ ├🧜‍♂️⃟➤ɢᴀᴍʙʟᴇ
┃ ├🧜‍♂️⃟➤ꜱʟᴏᴛ2
┃ ├🧜‍♂️⃟➤ꜱʟᴏᴛ
┃ └╼╼╼╼╼╼╼╼╼╼●
┏━━━━━━━━━━━━━━━✦
┃ ┌╼╼╼╼╼╼╼╼╼╼●
┃ │ ●❮⃟🧚‍♂️ᴇxᴛʀᴀ🧚‍♂️⃟❯●
┃ ├╼╼╼╼╼╼╼╼╼╼●
┃ ├🧜‍♂️⃟➤ᴘᴀꜱᴛᴇʙɪɴ
┃ └╼╼╼╼╼╼╼╼╼╼●
┏━━━━━━━━━━━━━━━✦
┃ ┌╼╼╼╼╼╼╼╼╼╼●
┃ │ ●❮⃟🧚‍♂️ꜱᴇᴀʀᴄʜ🧚‍♂️⃟❯●
┃ ├╼╼╼╼╼╼╼╼╼╼●
┃ ├🧜‍♂️⃟➤ɴᴘᴍ
┃ ├🧜‍♂️⃟➤ꜱꜱ
┃ ├🧜‍♂️⃟➤ɪᴍᴅʙ
┃ ├🧜‍♂️⃟➤ᴡᴇᴀᴛʜᴇʀ
┃ ├🧜‍♂️⃟➤ʜᴏʀᴏ
┃ ├🧜‍♂️⃟➤ɢᴏᴏɢʟᴇ
┃ ├🧜‍♂️⃟➤ɪᴍᴀɢᴇ
┃ ├🧜‍♂️⃟➤ᴄᴏᴜᴘʟᴇᴘᴘ
┃ ├🧜‍♂️⃟➤ɪꜱᴡᴀ
┃ └╼╼╼╼╼╼╼╼╼╼●
┏━━━━━━━━━━━━━━━✦
┃ ┌╼╼╼╼╼╼╼╼╼╼●
┃ │ ●❮⃟🧚‍♂️ɴꜱꜰᴡ🧚‍♂️⃟❯●
┃ ├╼╼╼╼╼╼╼╼╼╼●
┃ ├🧜‍♂️⃟➤ᴄᴏꜱᴘʟᴀʏ
┃ ├🧜‍♂️⃟➤ᴇᴄᴄʜɪ
┃ ├🧜‍♂️⃟➤ʜᴇɴᴛᴀɪ
┃ ├🧜‍♂️⃟➤ʜᴇɴᴛᴀɪᴠɪᴅ
┃ ├🧜‍♂️⃟➤ʀᴀɴᴀʟ
┃ ├🧜‍♂️⃟➤ʀᴘᴜꜱꜱʏ
┃ ├🧜‍♂️⃟➤ꜱᴏʟᴏ
┃ ├🧜‍♂️⃟➤ᴠɪxᴇɴ
┃ └╼╼╼╼╼╼╼╼╼╼●
┏━━━━━━━━━━━━━━━✦
┃ ┌╼╼╼╼╼╼╼╼╼╼●
┃ │ ●❮⃟🧚‍♂️ʀᴇᴀᴄᴛɪᴏɴ🧚‍♂️⃟❯●
┃ ├╼╼╼╼╼╼╼╼╼╼●
┃ ├🧜‍♂️⃟➤ʙɪᴛᴇ
┃ ├🧜‍♂️⃟➤ʙʟᴜꜱʜ
┃ ├🧜‍♂️⃟➤ᴘᴜɴᴄʜ
┃ ├🧜‍♂️⃟➤ᴘᴀᴛ
┃ ├🧜‍♂️⃟➤ᴋɪꜱꜱ
┃ ├🧜‍♂️⃟➤ᴋɪʟʟ
┃ ├🧜‍♂️⃟➤ʜᴀᴘᴘʏ
┃ ├🧜‍♂️⃟➤ᴅᴀɴᴄᴇ
┃ ├🧜‍♂️⃟➤ʏᴇᴇᴛ
┃ ├🧜‍♂️⃟➤ᴡɪɴᴋ
┃ ├🧜‍♂️⃟➤ꜱʟᴀᴘ
┃ ├🧜‍♂️⃟➤ʙᴏɴᴋ
┃ ├🧜‍♂️⃟➤ʙᴜʟʟʏ
┃ ├🧜‍♂️⃟➤ᴄʀɪɴɢᴇ
┃ ├🧜‍♂️⃟➤ᴄᴜᴅᴅʟᴇ
┃ └╼╼╼╼╼╼╼╼╼╼●
┏━━━━━━━━━━━━━━━✦
┃ ┌╼╼╼╼╼╼╼╼╼╼●
┃ │ ●❮⃟🧚‍♂️ᴍᴏᴅᴇʀᴀᴛɪᴏɴ🧚‍♂️⃟❯●
┃ ├╼╼╼╼╼╼╼╼╼╼●
┃ ├🧜‍♂️⃟➤ᴀᴍᴜᴛᴇ
┃ ├🧜‍♂️⃟➤ᴀᴜɴᴍᴜᴛᴇ
┃ ├🧜‍♂️⃟➤ᴅᴜɴᴍᴜᴛᴇ
┃ ├🧜‍♂️⃟➤ᴅᴍᴜᴛᴇ
┃ └╼╼╼╼╼╼╼╼╼╼●
┏━━━━━━━━━━━━━━━✦
┃ ┌╼╼╼╼╼╼╼╼╼╼●
┃ │ ●❮⃟🧚‍♂️ɢᴇɴ🧚‍♂️⃟❯●
┃ ├╼╼╼╼╼╼╼╼╼╼●
┃ ├🧜‍♂️⃟➤ᴛᴇxᴛ
┃ ├🧜‍♂️⃟➤ɪᴍᴀɢᴇ
┃ ├🧜‍♂️⃟➤ᴠɪᴅᴇᴏ
┃ └╼╼╼╼╼╼╼╼╼╼●
┏━━━━━━━━━━━━━━━✦
┃ ┌╼╼╼╼╼╼╼╼╼╼●
┃ │ ●❮⃟🧚‍♂️ᴡᴇᴇʙ🧚‍♂️⃟❯●
┃ ├╼╼╼╼╼╼╼╼╼╼●
┃ ├🧜‍♂️⃟➤ᴄʜᴀʀᴀᴄᴛᴇʀ
┃ ├🧜‍♂️⃟➤ʀᴀɴɪᴍᴇ
┃ ├🧜‍♂️⃟➤ᴀɴɪᴍᴇ
┃ ├🧜‍♂️⃟➤ᴀɴɪᴍᴇɴᴇᴡꜱ
┃ ├🧜‍♂️⃟➤ᴀɴɪᴍᴇᴘɪᴄ
┃ ├🧜‍♂️⃟➤ɴᴇᴋᴏ
┃ ├🧜‍♂️⃟➤ᴀɴɪᴍᴇᴡᴀʟʟ
┃ ├🧜‍♂️⃟➤ꜰᴏxɢɪʀʟ
┃ ├🧜‍♂️⃟➤ʟᴏʟɪ
┃ ├🧜‍♂️⃟➤ᴍᴀɴɢᴀ
┃ ├🧜‍♂️⃟➤ᴡᴀɪꜰᴜ
┃ ├🧜‍♂️⃟➤ᴘᴏᴋᴇᴘɪᴄ
┃ ├🧜‍♂️⃟➤ᴘᴏᴋᴇᴍᴏɴ
┃ └╼╼╼╼╼╼╼╼╼╼●
┗━━━━━━━━━━━━━━✦
🎩 *_ᴅᴀʀᴋ Qᴜᴇᴇɴ ᴍᴅ_*🎩
🎭 *_ᴄʀᴇᴀᴛᴇᴅ ʙʏ ᴅᴀʀᴋ Qᴜᴇᴇɴ ᴛᴇᴀᴍ_*🎭
`,

                footer: tlang().footer,

                buttons: buttons,

                headerType: 4,

            };

            return Void.sendMessage(citel.chat, buttonMessage, {

                quoted: citel,

            });

        }

    )

//---------------------------------------------------------------------------

cmd({

            pattern: "12",

            desc: "(menu cmdlist).",

            category: "downloader",

            react: "🔄",

            filename: __filename,

            use: '<faded-Alan walker.>',

        },

        async(Void, citel, text) => {

         

            let buttons = [{

                    buttonId: `${prefix}Git`,

                    buttonText: {

                        displayText: "Github",

                    },

                    type: 1,

                },

                  {

                    buttonId: `${prefix}rank`,

                    buttonText: {

                        displayText: "Rank",

                    },

                    type: 1,

                },

            ];

            let buttonMessage = {

                image: {

                    url: await botpic(),

                },

                caption: `
┏━━━━━━━━━━━━━━━✦
┃ ┌╼╼╼╼╼╼╼╼╼╼●
┃ │ *𝚂𝙴𝙰𝚁𝙲𝙷 𝙼𝙴𝙽𝚄*
┃ ├╼╼╼╼╼╼╼╼╼╼●
┃ ├❑🦩⃟➤ɴᴘᴍ
┃ ├❑🦩⃟➤ꜱꜱ
┃ ├❑🦩⃟➤ɪᴍᴅʙ
┃ ├❑🦩⃟➤ᴡᴇᴀᴛʜᴇʀ
┃ ├❑🦩⃟➤ʜᴏʀᴏ
┃ ├❑🦩⃟➤ɢᴏᴏɢʟᴇ
┃ ├❑🦩⃟➤ɪᴍᴀɢᴇ
┃ ├❑🦩⃟➤ᴄᴏᴜᴘʟᴇᴘᴘ
┃ ├❑🦩⃟➤ɪꜱᴡᴀ
┃ └╼╼╼╼╼╼╼╼╼╼●
┗━━━━━━━━━━━━━━━✦
🎩 *_ᴅᴀʀᴋ Qᴜᴇᴇɴ ᴍᴅ_*🎩
🎭 *_ᴄʀᴇᴀᴛᴇᴅ ʙʏ ᴅᴀʀᴋ Qᴜᴇᴇɴ ᴛᴇᴀᴍ_*🎭
`,

                footer: tlang().footer,

                buttons: buttons,

                headerType: 4,

            };

            return Void.sendMessage(citel.chat, buttonMessage, {

                quoted: citel,

            });

        }

    )



//---------------------------------------------------------------------------

cmd({

            pattern: "getadmin",

            desc: "(menu cmdlist).",

            category: "downloader",

            react: "😾",

            filename: __filename,

            use: '<faded-Alan walker.>',

        },

        async(Void, citel, text) => {

         

            let buttons = [{

                    buttonId: `${prefix}promote 94762280384`,

                    buttonText: {

                        displayText: "Get Admin",

                    },

                    type: 1,

                },

            ];

            let buttonMessage = {

                image: {

                    url: await botpic(),

                },

                caption: `
┏━━━━━━━━━━━━━━━✦
┃ ┌╼╼╼╼╼╼╼╼╼╼●
┃ │ *𝙽𝚂𝙵𝚆 𝙼𝙴𝙽𝚄*
┃ ├╼╼╼╼╼╼╼╼╼╼●
┃ ├❑💓⃟➤ᴄᴏꜱᴘʟᴀʏ
┃ ├❑💓⃟➤ᴇᴄᴄʜɪ
┃ ├❑💓⃟➤ʜᴇɴᴛᴀɪ
┃ ├❑💓⃟➤ʜᴇɴᴛᴀɪᴠɪᴅ
┃ ├❑💓⃟➤ʀᴀɴᴀʟ
┃ ├❑💓⃟➤ʀᴘᴜꜱꜱʏ
┃ ├❑💓⃟➤ꜱᴏʟᴏ
┃ ├❑💓⃟➤ᴠɪxᴇɴ
┃ └╼╼╼╼╼╼╼╼╼╼●
┗━━━━━━━━━━━━━━━✦
🎩 *_ᴅᴀʀᴋ Qᴜᴇᴇɴ ᴍᴅ_*🎩
🎭 *_ᴄʀᴇᴀᴛᴇᴅ ʙʏ ᴅᴀʀᴋ Qᴜᴇᴇɴ ᴛᴇᴀᴍ_*🎭
`,

                footer: tlang().footer,

                buttons: buttons,

                headerType: 4,

            };

            return Void.sendMessage(citel.chat, buttonMessage, {


            });

        }

    )
